Updated README file
